# ViewSolarstudyMultidayPresetIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyMultidayPresetIndex Property
ParameterTypeId Class See Also
---
"Multi-day presets combo"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyMultidayPresetIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyMultidayPresetIndex As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyMultidayPresetIndex {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace